Documents/ВСД2_КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВСД2_КорректировкаРеализации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВСДКАннулированию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кб99_ВСД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВСД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_СтатусВСД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВСДКГашению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кб99_ВСД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВСД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_СтатусВСД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОформленныеКорректировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВСД2_КорректировкаРеализации/Forms/ФормаДокумента/Ext/Form/Module.bsl
// GRACE:MODULE_START name="КорректировкаРеализации"
// @grace-module: КорректировкаРеализации
// @grace-purpose: Форма документа ВСД2_КорректировкаРеализации — аннулирование и гашение ВСД, формирование корректировочных транзакций
// @grace-depends: КорректировкаРеализации, ЯдроВСД, ИнтеграцияВетИС_API
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="КорректировкаРеализации"
// GRACE:DEPENDENCY target="кб99_ВСД"
// GRACE:DEPENDENCY target="ВетИС_APIСервер"

// @grace-contract: ЗавершитьОбновлениеСтатусов
//   Вход: Результат (Структура) — результат длительной операции, ДополнительныеПараметры (Структура)
//   Выход: нет (заполняет ТЧ из хранилища, показывает оповещение)
//   Инвариант: вызывается как callback ДлительныеОперацииКлиент.ОжидатьЗавершение

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ДокументРеализации) Тогда
		
		// Устанавливаем флаг необходимости обновления статусов при открытии
		ОбновлятьСтатусыПриОткрытии = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьФормы();
	
	Если ОбновлятьСтатусыПриОткрытии Тогда
		ЗапуститьОбновлениеСтатусов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьФормы()
	
	Если Объект.Обработан Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицы

&НаКлиенте
Процедура ВСДКАннулированиюПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВСДКАннулированию.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено И ТекущаяСтрока.Обработан Тогда
		ТекущаяСтрока.Отметка = Ложь;
		ПоказатьПредупреждение(, "Строка уже была обработана!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВСДКГашениюПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВСДКГашению.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено И ТекущаяСтрока.Обработан Тогда
		ТекущаяСтрока.Отметка = Ложь;
		ПоказатьПредупреждение(, "Строка уже была обработана!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ИмяТЧ = СтрЗаменить(Команда.Имя, "ОтметитьВсе", "");
	Если ПустаяСтрока(ИмяТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		Если Не СтрокаТЧ.Обработан Тогда
			СтрокаТЧ.Отметка = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	ИмяТЧ = СтрЗаменить(Команда.Имя, "СнятьОтметки", "");
	Если ПустаяСтрока(ИмяТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
		СтрокаТЧ.Отметка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьВСД(Команда)
	
	СписокВСД = ПолучитьСписокОтмеченных(Объект.ВСДКАннулированию);
	Если СписокВСД.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны ВСД для аннулирования.");
		Возврат;
	КонецЕсли;
	
	АннулироватьВСДНаСервере(СписокВСД);
	
	// Актуализируем статусы и помечаем строки как обработанные
	ОбновитьСтатусыВТЧНаСервере("ВСДКАннулированию", СписокВСД);
	
	Записать();
	
	УстановитьДоступностьФормы();
	
	ПоказатьОповещениеПользователя("Запросы на аннулирование отправлены.");
	
КонецПроцедуры

&НаКлиенте
Процедура ПогаситьВСД(Команда)
	
	СписокВСД = ПолучитьСписокОтмеченных(Объект.ВСДКГашению);
	Если СписокВСД.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны ВСД для гашения.");
		Возврат;
	КонецЕсли;
	
	ПогаситьВСДНаСервере(СписокВСД);
	
	// Актуализируем статусы и помечаем строки как обработанные
	ОбновитьСтатусыВТЧНаСервере("ВСДКГашению", СписокВСД);
	
	Записать();
	
	УстановитьДоступностьФормы();
	
	ПоказатьОповещениеПользователя("Запросы на гашение отправлены.");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКорректировочныеВСД(Команда)
	
	Результат = СформироватьКорректировочныеВСДНаСервере();
	
	Если Результат.Количество > 0 Тогда
		
		Для Каждого Ссылка Из Результат.Ссылки Цикл
			ПоказатьЗначение(, Ссылка);
		КонецЦикла;
		
		ПоказатьОповещениеПользователя("Сформировано корректировочных транзакций: " + Результат.Количество);
		
	Иначе
		ПоказатьПредупреждение(, "Нет данных для формирования корректировочных ВСД (возможно, ВСД еще не аннулированы или уже оформлены).");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьКорректировочныеВСДНаСервере()
	
	Результат = Новый Структура("Количество, Ссылки", 0, Новый Массив);
	
	// 1. Собираем уникальные ВСД2_транзакция из аннулированных строк
	СоответствиеТранзакций = Новый Соответствие; // Ключ - Ссылка на транзакцию, Значение - Массив аннулированных ВСД
	
	Для Каждого Стр Из Объект.ВСДКАннулированию Цикл
		
		Если Стр.Обработан И ЗначениеЗаполнено(Стр.ВСД2_транзакция) Тогда
			
			// Проверяем статус самого ВСД в базе (он должен быть WITHDRAWN)
			СтатусВСД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ВСД, "СтатусВСД");
			Если СтатусВСД <> Перечисления.кб99_СтатусВСД.WITHDRAWN Тогда
				Продолжить;
			КонецЕсли;
			
			// Проверяем, не оформлена ли уже корректировка для этого ВСД
			ЗапросПовтор = Новый Запрос;
			ЗапросПовтор.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ВСД2_транзакцияТовары.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ВСД2_транзакция.Товары КАК ВСД2_транзакцияТовары
				|ГДЕ
				|	ВСД2_транзакцияТовары.UUID_ВСД = &UUID_ВСД
				|	И ВСД2_транзакцияТовары.Ссылка.ПометкаУдаления = ЛОЖЬ";
			ЗапросПовтор.УстановитьПараметр("UUID_ВСД", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ВСД, "UUID"));
			
			Если Не ЗапросПовтор.Выполнить().Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			МассивВСД = СоответствиеТранзакций[Стр.ВСД2_транзакция];
			Если МассивВСД = Неопределено Тогда
				МассивВСД = Новый Массив;
				СоответствиеТранзакций.Вставить(Стр.ВСД2_транзакция, МассивВСД);
			КонецЕсли;
			
			Если МассивВСД.Найти(Стр.ВСД) = Неопределено Тогда
				МассивВСД.Добавить(Стр.ВСД);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СоответствиеТранзакций.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	// 2. Для каждой исходной транзакции создаем корректировочную
	Для Каждого КЗ Из СоответствиеТранзакций Цикл
		
		ИсходнаяТранзакция = КЗ.Ключ;
		СписокАннулированных = КЗ.Значение;
		
		// Создаем новый документ ВСД2_транзакция на основании исходной
		НоваяТранзакция = Документы.ВСД2_транзакция.СоздатьДокумент();
		НоваяТранзакция.Заполнить(ИсходнаяТранзакция);
		
		// Очищаем ТЧ Товары, так как стандартное заполнение может подтянуть лишнее или не то
		НоваяТранзакция.Товары.Очистить();
		
		// Заполняем товары только по аннулированным ВСД из нашей таблицы
		Для Каждого СсылкаВСД Из СписокАннулированных Цикл
			
			// Получаем данные ВСД (продукция, количество и т.д.)
			ДанныеВСД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаВСД, 
				"Продукция_Элемент, Продукция, ВидПродукции, ЕдиницаИзмерения, Количество, UUID, GTIN, Артикул, РезультатыИсследований, Цель");
			
			НоваяСтрока = НоваяТранзакция.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеВСД);
			НоваяСтрока.UUID_ВСД = ДанныеВСД.UUID;
			НоваяСтрока.КлючСтроки = Строка(Новый УникальныйИдентификатор);
			
			// Ищем ИдентификаторСтроки и Номенклатуру из нашей таблицы для связи
			ПараметрыПоиска = Новый Структура("ВСД", СсылкаВСД);
			СтрокиВТЧ = Объект.ВСДКАннулированию.НайтиСтроки(ПараметрыПоиска);
			Если СтрокиВТЧ.Количество() > 0 Тогда
				НоваяСтрока.ИдентификаторСтроки = СтрокиВТЧ[0].ИдентификаторСтроки;
				НоваяСтрока.Номенклатура        = СтрокиВТЧ[0].Номенклатура;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НоваяТранзакция.Товары.Количество() > 0 Тогда
			НоваяТранзакция.Записать(РежимЗаписиДокумента.Запись);
			Результат.Количество = Результат.Количество + 1;
			Результат.Ссылки.Добавить(НоваяТранзакция.Ссылка);
			
			// Добавляем в ТЧ ОформленныеКорректировки
			НоваяСтрКорр = Объект.ОформленныеКорректировки.Добавить();
			НоваяСтрКорр.ВСД2_транзакция = НоваяТранзакция.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат.Количество > 0 Тогда
		Записать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДлительныеОперации

&НаКлиенте
Процедура ЗапуститьОбновлениеСтатусов()
	
	РезультатЗапуска = ЗапуститьОбновлениеСтатусовНаСервере();
	
	Если РезультатЗапуска.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
		ПараметрыОжидания.ТекстСообщения = "Обновление и распределение ВСД...";
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьОбновлениеСтатусов", ЭтаФорма);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗапуска, ОповещениеОЗавершении, ПараметрыОжидания);
		
	ИначеЕсли РезультатЗапуска.Статус = "Выполнено" Тогда
		
		ПоказатьОповещениеПользователя("Статусы ВСД обновлены и распределены");
		
	ИначеЕсли РезультатЗапуска.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатЗапуска.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОбновлениеСтатусов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ЗаполнитьТабличныеЧастиИзХранилища(Результат.АдресРезультата);
		ПоказатьОповещениеПользователя("Статусы ВСД обновлены и распределены");
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьОбновлениеСтатусовНаСервере()
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументРеализации, "Организация");
	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Контрагент");
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Новый Структура("Статус", "Ошибка", "КраткоеПредставлениеОшибки", "Не определена организация.");
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументКорректировки", Объект.ДокументОснование);
	ПараметрыПроцедуры.Вставить("ДокументРеализации", Объект.ДокументРеализации);
	ПараметрыПроцедуры.Вставить("Организация", Организация);
	ПараметрыПроцедуры.Вставить("Контрагент", Контрагент);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Обновление и распределение ВСД (Корректировка)";
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("ВетИС_APIСервер.ОбновитьИРаспределитьВСД_Фон", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличныеЧастиИзХранилища(Знач АдресРезультата)
	
	Данные = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем реквизиты шапки
	Если Данные.Свойство("ДанныеШапки") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Данные.ДанныеШапки);
	КонецЕсли;
	
	Объект.ВСДКАннулированию.Очистить();
	Объект.ВСДКГашению.Очистить();
	
	Для Каждого Стр Из Данные.ВСДКАннулированию Цикл
		НоваяСтрока = Объект.ВСДКАннулированию.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	Для Каждого Стр Из Данные.ВСДКГашению Цикл
		НоваяСтрока = Объект.ВСДКГашению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ПолучитьСписокОтмеченных(Коллекция)
	
	Результат = Новый Массив;
	Для Каждого Стр Из Коллекция Цикл
		Если Стр.Отметка Тогда
			Результат.Добавить(Стр.ВСД);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура АннулироватьВСДНаСервере(Знач СписокВСД)
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументРеализации, "Организация");
	ПараметрыИнтеграции = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
	
	Для Каждого СсылкаВСД Из СписокВСД Цикл
		АннулироватьВСД_Один(СсылкаВСД, ПараметрыИнтеграции);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПогаситьВСДНаСервере(Знач СписокВСД)
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументРеализации, "Организация");
	ПараметрыИнтеграции = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
	
	Для Каждого СсылкаВСД Из СписокВСД Цикл
		
		// Подготовка параметров для гашения
		ПараметрыГашения = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Организация);
		ПараметрыГашения.Отправитель_Площадка = СсылкаВСД.Получатель_Площадка; // Наша площадка
		
		ПараметрыГашения.Вставить("флАктНесоответствия", Ложь);
		ПараметрыГашения.Вставить("тПричинаАкта", "");
		ПараметрыГашения.Вставить("тОписаниеНесоответствия", "");
		ПараметрыГашения.Вставить("ИсключитьИзПодбораПригашении", Ложь);
		
		ВетИС_APIСервер.ВСД2_Входящий_ОтправитьГашение(ПараметрыГашения, СсылкаВСД, Неопределено);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура АннулироватьВСД_Один(Знач ВСД, Знач ПараметрыИнтеграции)
	
	ПараметрыАннулирования = ВетИС_ЯдроСервер.ЗагрузитьПараметры(ПараметрыИнтеграции.Организация);
	ПараметрыАннулирования["Отправитель_Площадка"] = ВСД.Отправитель_Площадка;
	
	ПараметрыФункции = Новый Структура("Параметры, ДокОснование", ПараметрыАннулирования, ВСД);
	ВетИС_APIСервер.ВСД2_Аннулировать(ПараметрыФункции);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыВТЧНаСервере(Знач ИмяТЧ, Знач СписокВСД)
	
	Для Каждого СсылкаВСД Из СписокВСД Цикл
		ПараметрыПоиска = Новый Структура("ВСД", СсылкаВСД);
		НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(ПараметрыПоиска);
		Для Каждого Стр Из НайденныеСтроки Цикл
			Стр.СтатусВСД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ВСД, "СтатусВСД");
			Стр.Обработан = Истина;
			Стр.Отметка   = Ложь;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
// GRACE:MODULE_END name="КорректировкаРеализации"
